package com.news.backend.util.exl;



/**
 * 正则表达式的枚举类
 * @author yu 2016-06-06
 *
 */
public enum RegexEnum {
	REGEX_NUMBER("^-?(?:\\d+|\\d{1,3}(?:,\\d{3})+)(?:\\.\\d+)?$","只允许输入小数"),
	REGEX_DIGITS("^\\d+$","只允许输入[0-9]之间的数字"),
	
	REGEX_CH_EH_NUM("^[(-.A-Za-z0-9\u4e00-\u9fa5]*$","只允许输入英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_7("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,7}$","只允许输入0-7位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_10("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,10}$","只允许输入0-10位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_16("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,16}$","只允许输入0-16位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_20("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,20}$","只允许输入0-20位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_32("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,32}$","只允许输入0-32位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_50("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,50}$","只允许输入0-50位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_64("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,64}$","只允许输入0-64位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_85("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,85}$","只允许输入0-85位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM0_255("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{0,255}$","只允许输入0-255位英文字母、数字、中文汉字、指定特殊字符"),
	
	REGEX_CH_EH_NUM1_7("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,7}$","只允许输入1-7位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_10("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,10}$","只允许输入1-10位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_16("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,16}$","只允许输入1-16位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_20("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,20}$","只允许输入1-20位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_21("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,21}$","只允许输入1-21位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_26("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,26}$","只允许输入1-26位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_32("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,32}$","只允许输入1-32位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_50("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,50}$","只允许输入1-50位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_64("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,64}$","只允许输入1-64位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_80("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,80}$","只允许输入1-80位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM1_255("^[ -.（-）A-Za-z0-9\u4e00-\u9fa5]{1,255}$","只允许输入1-255位英文字母、数字、中文汉字、指定特殊字符"),

	
	REGEX_CH_EH_NUM_20("^[ -.（-）A-Za-z0-9]{0,20}$","只允许输入0-20位英文字母、数字、指定特殊字符"),
	REGEX_CH_EH_NUM_50("^[ -.（-）A-Za-z0-9]{0,50}$","只允许输入0-50位英文字母、数字"),
	REGEX_CH_EH_NUM_1_32_CHECK("^[ -.·-·（-）A-Za-z、-、@-@0-9\u4e00-\u9fa5]{1,32}$","只允许输入1-32位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_0_85_CHECK("^[ -.·-·（-）A-Za-z、-、@-@0-9\u4e00-\u9fa5]{0,85}$","只允许输入0-85位英文字母、数字、中文汉字、指定特殊字符"),
	
	//常用中文字符用utf-8编码占用3个字节,GBK、GB2312收编的汉字占2个字节
	REGEX_CH_EH_NUM_T_0_6("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,6}$","只允许输入0-6位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_10("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,10}$","只允许输入0-10位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_16("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,16}$","只允许输入0-16位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_20("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,20}$","只允许输入0-20位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_26("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,26}$","只允许输入0-26位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_31("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,31}$","只允许输入0-31位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_50("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,50}$","只允许输入0-50位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_80("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{0,80}$","只允许输入0-80位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_0_85("^[\u4e00-\u9fa5\\s,、#a-zA-Z0-9(-.]{0,85}$","只允许输入0-85位英文字母、数字、中文汉字、指定特殊字符"),
	
	REGEX_CH_EH_NUM_T_1_10("^[\u4e00-\u9fa5\\s,、a-zA-Z0-9(-.]{1,10}$","只允许输入1-10位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_1_16("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{1,16}$","只允许输入1-16位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_T_1_26("^[\u4e00-\u9fa5\\s,a-zA-Z0-9(-.]{1,26}$","只允许输入1-26位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM_21("^[A-Za-z0-9]{0,21}$","只允许输入0-21位英文字母、数字"),
	REGEX_CH_EH_NUM_30("^[A-Za-z0-9]{0,30}$","只允许输入0-30位英文字母、数字"),
	REGEX_CH_EH_NUM_32("^[A-Za-z0-9]{0,32}$","只允许输入0-32位英文字母、数字"),
	REGEX_CH_EH_NUM_64("^[A-Za-z0-9]{0,64}$","只允许输入0-64位英文字母、数字"),
	REGEX_CH_EH_NUM_0_50("^[A-Za-z+-9]{0,50}$","只允许输入0-50位英文字母、数字"),//支持+'-。\特殊字符
	REGEX_CH_EH_NUM_80("^[A-Za-z0-9]{0,80}$","只允许输入0-80位英文字母、数字"),
	
	REGEX_CH_EH_NUM_1_10("^[A-Za-z0-9]{1,10}$","只允许输入1-10位英文字母、数字"),
	REGEX_CH_EH_NUM_1_16("^[A-Za-z0-9]{1,16}$","只允许输入1-16位英文字母、数字"),
	REGEX_CH_EH_NUM_1_20("^[A-Za-z0-9]{1,20}$","只允许输入1-20位英文字母、数字"),
	REGEX_CH_EH_NUM_1_21("^[A-Za-z0-9]{1,21}$","只允许输入1-21位英文字母、数字"),
	REGEX_CH_EH_NUM_1_30("^[A-Za-z0-9]{1,30}$","只允许输入1-30位英文字母、数字"),
	REGEX_CH_EH_NUM_1_50("^[A-Za-z0-9]{1,50}$","只允许输入1-50位英文字母、数字"),
	
	REGEX_CH_EH_NUM_T_1_1_CHAR("^[^\\s]{1,1}$","只允许输入1-1位字符"),
	REGEX_CH_EH_NUM_T_1_7_CHAR("^[^\\s]{1,7}$","只允许输入1-7位字符"),
	REGEX_CH_EH_NUM_T_1_10_CHAR("^[^\\s]{1,10}$","只允许输入1-10位字符"),
	REGEX_CH_EH_NUM_T_1_16_CHAR("^[^\\s]{1,16}$","只允许输入1-16位字符"),
	REGEX_CH_EH_NUM_T_1_20_CHAR("^[^\\s]{1,20}$","只允许输入1-20位字符"),
	REGEX_CH_EH_NUM_T_1_26_CHAR("^[^\\s]{1,26}$","只允许输入1-26位字符"),
	REGEX_CH_EH_NUM_T_1_32_CHAR("^[^*]{1,32}$","只允许输入1-32位字符"),//支持特殊字符和空格，不支持*
	REGEX_CH_EH_NUM_T_1_40_CHAR("^[^\\s]{1,40}$","只允许输入1-40位字符"),
	REGEX_CH_EH_NUM_T_1_50_CHAR("^[^\\s]{1,50}$","只允许输入1-50位字符"),
	REGEX_CH_EH_NUM_T_1_64_CHAR("^[^\\s]{1,64}$","只允许输入1-64位字符"),
	REGEX_CH_EH_NUM_T_1_85_CHAR("^[^\\s]{1,85}$","只允许输入1-85位字符"),
	REGEX_CH_EH_NUM_T_1_255_CHAR("^[^\\s]{1,255}$","只允许输入1-255位字符"),
	
	REGEX_CH_EH_NUM_T_0_7_CHAR("^[^\\s]{0,7}$","只允许输入0-7位字符"),
	REGEX_CH_EH_NUM_T_0_10_CHAR("^[^\\s]{0,10}$","只允许输入0-10位字符"),
	REGEX_CH_EH_NUM_T_0_16_CHAR("^[^\\s]{0,16}$","只允许输入0-16位字符"),
	REGEX_CH_EH_NUM_T_0_20_CHAR("^[^\\s]{0,20}$","只允许输入0-20位字符"),
	REGEX_CH_EH_NUM_T_0_26_CHAR("^[^\\s]{0,26}$","只允许输入0-26位字符"),
	REGEX_CH_EH_NUM_T_0_32_CHAR("^[^\\s]{0,32}$","只允许输入0-32位字符"),
	REGEX_CH_EH_NUM_T_0_40_CHAR("^[^\\s]{0,40}$","只允许输入0-40位字符"),
	REGEX_CH_EH_NUM_T_0_50_CHAR("^[^\\s]{0,50}$","只允许输入0-50位字符"),
	REGEX_CH_EH_NUM_T_0_64_CHAR("^[^\\s]{0,64}$","只允许输入0-64位字符"),
	REGEX_CH_EH_NUM_T_0_80_CHAR("^[^\\s]{0,80}$","只允许输入0-80位字符"),
	REGEX_CH_EH_NUM_T_0_85_CHAR("^[^*]{0,85}$","只允许输入0-85位字符"),//支持特殊字符和空格,不支持*
	REGEX_CH_EH_NUM_T_0_255_CHAR("^[^\\s]{0,255}$","只允许输入0-255位字符"),
	REGEX_CH_EH_NUM_T_0_150_CHAR("^[^\\s]{0,150}$","只允许输入0-150位字符"),
	
	REGEX_CH_EH_NUM2_60("^[(-.A-Za-z0-9\u4e00-\u9fa5]{2,60}$","只允许输入2-60位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM3_30("^[(-.A-Za-z0-9\u4e00-\u9fa5]{3,30}$","只允许输入3-30位英文字母、数字、中文汉字、指定特殊字符"),
	REGEX_CH_EH_NUM2_500("^[(-.A-Za-z0-9\u4e00-\u9fa5]*$","只允许输入2-500位英文字母、数字、中文汉字、指定特殊字符"),
	
	REGEX_ONLY_NUM1("^[0-1]{0,1}$","只允许输入0或1"),
	REGEX_ONLY_NUM1_1("^[0-9]{1}$","只允许输入1位数字"),
	REGEX_ONLY_NUM1_2("^[0-9]{1,2}$","只允许输入1-2位数字"),
	REGEX_ONLY_NUM2("^[0-9]{2}$","只允许输入2位数字"),
	REGEX_ONLY_NUM8_11("^[0-9]{8,11}$","只允许输入8-11位数字"),
	REGEX_ONLY_NUM0_20("^[0-9]{0,20}$","只允许输入0-11位数字,027-0752285"),
	REGEX_ONLY_NUM2_32("^[0-9]{2,32}$","只允许输入2-32位数字"),
	REGEX_ONLY_NUM0_100("^[0-9]{0,100}$","只允许输入0-100位数字"),
	REGEX_ONLY_NUM1_100("^[0-9]{1,100}$","只允许输入1-100位数字"),
	
	REGEX_ONLY_NUM15("^[a-zA-Z0-9]{15}$","只允许输入15位的数字或字母"),
	REGEX_ONLY_NUM16("^[a-zA-Z0-9]{16}$","只允许输入16位的数字或字母"),
	
	REGEX_EH_NUM("^[A-Za-z0-9]*$","只允许输入英文字母、数字"),
	REGEX_AMOUNT("^\\d{1,16}(\\.\\d{1,2}){0,1}$","只允许输入金额型数字"),
	REGEX_AMOUNT4("^\\d{1,16}(\\.\\d{1,4}){0,1}$","只允许输入数字,小数点后最多4位"),
	REGEX_AMOUNT18("^\\d{0,18}$","只允许输入整数的金额型0-18位数字"),
	
	REGEX_URL("^((http|https?|ftp|news)://)*[A-Za-z0-9]+((\\.|-)[A-Za-z0-9]+)*\\.[A-Za-z0-9]+$","请输入合法的网址"),
	REGEX_GRADE("^注册会员|铜牌会员|银牌会员|金牌会员|钻石会员$","只允许输入[注册会员、铜牌会员、银牌会员、金牌会员、钻石会员]中的一个"),
	REGEX_EMAIL("^\\w+((-\\w+)|(\\.\\w+))*\\@[A-Za-z0-9]+((\\.|-)[A-Za-z0-9]+)*\\.[A-Za-z0-9]+$","邮箱格式不正确"), //邮件
	
	REGEX_POST("^[0-9]{6}|{0}$","只允许输入6位邮政编码"),
	REGEX_SHENGFENZHENG("^[1-9]\\d{5}[1-9]\\d{3}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{4}$","只允许输入18位身份证"),
	//请输入正确的日期，如：2016-01-01
	REGEX_DATA10("^((\\d{2}(([02468][048])|([13579][26]))[\\-\\/\\s]?((((0?[13578])|(1[02]))[\\-\\/\\s]?((0?[1-9])|([1-2][0-9])|(3[01])))|(((0?[469])|(11))[\\-\\/\\s]?((0?[1-9])|([1-2][0-9])|(30)))|(0?2[\\-\\/\\s]?((0?[1-9])|([1-2][0-9])))))|(\\d{2}(([02468][1235679])|([13579][01345789]))[\\-\\/\\s]?((((0?[13578])|(1[02]))[\\-\\/\\s]?((0?[1-9])|([1-2][0-9])|(3[01])))|(((0?[469])|(11))[\\-\\/\\s]?((0?[1-9])|([1-2][0-9])|(30)))|(0?2[\\-\\/\\s]?((0?[1-9])|(1[0-9])|(2[0-8]))))))","请输入正确的日期，如：2016-01-01"),
	REWGEX_TEL("^((13[0-9])|(15[^4,\\D])|(18[^1^4,\\D]))\\d{8}$","手机格式不正确")
	;
	private String regexValue;
	private String errorMessage;
	public String getRegexValue() {
		return regexValue;
	}
	public void setRegexValue(String regexValue) {
		this.regexValue = regexValue;
	}
	public String getErrorMessage() {
		return errorMessage;
	}
	public void setErrorMessage(String errorMessage) {
		this.errorMessage = errorMessage;
	}
	private RegexEnum(String regexValue,String errorMessage){
		this.regexValue = regexValue;
		this.errorMessage = errorMessage;
	}
}
